// Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.WriteLine("Hello, please fill in 5 digit number");

int number = int.Parse(Console.ReadLine());

